tutorials/thermoFluidSolidInteraction/hotTJunction/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet1
    {
        type          zeroGradient;
        value         uniform 0;
    }

    inlet2
    {
        type           zeroGradient;
        value          uniform 0;
    }

    interface
    {
	type           zeroGradient;
	value          uniform 0;
    }

    outlet
    {
	type           fixedValue;
	value          uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
