tutorials/thermoFluidSolidInteraction/hotTJunction/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (2 0 0)
    (3 0 0)
    (6 0 0)
    (6 2 0)
    (3 2 0)
    (3 4 0)
    (2 4 0)
    (2 2 0)
    (0 2 0)

    (0 0 1)
    (2 0 1)
    (3 0 1)
    (6 0 1)
    (6 2 1)
    (3 2 1)
    (3 4 1)
    (2 4 1)
    (2 2 1)
    (0 2 1)
);

blocks
(
    hex (0 1 8 9 10 11 18 19) (20 20 1) simpleGrading (1 1 1)
    hex (1 2 5 8 11 12 15 18) (10 20 1) simpleGrading (1 1 1)
    hex (2 3 4 5 12 13 14 15) (30 20 1) simpleGrading (1 1 1)
    hex (8 5 6 7 18 15 16 17) (10 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet1
    {
        type patch;
        faces
        (
            (0 10 19 9)
        );
    }
    inlet2
    {
        type patch;
        faces
        (
            (17 16 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 4 14 13)
        );
    }
    interface
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (1 2 12 11)
            (2 3 13 12)
            (15 14 4 5)
            (16 15 5 6)
            (18 17 7 8)
            (19 18 8 9)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (10 11 18 19)
            (11 12 15 18)
            (12 13 14 15)
            (18 15 16 17)
            (9 8 1 0)
            (8 5 2 1)
            (5 4 3 2)
            (7 6 5 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
