tutorials/thermoFluidSolidInteraction/hotTJunction/constant/fluid/time-series
(   
(0 (0 0 0))
(0.1 (0.001 0 0))
);   
